<?php

return [

	'v1' => [
		'user' => [

			'phone'    => 'شماره تلفن وارد شده معتبر نمی باشد.',
			'inactive' => 'حساب کاربری شما غیرفعال است.',

			'auth' => [
				'not_found' => 'کاربر با این مشخصات یافت نشد.',
			],

			'sms' => [
				'failed'   => 'ارسال پیامک با خطا مواجه شد.',
				'reset'    => 'پیامک حاوی کد بازیابی رمز عبور ارسال شد.',
				'login'    => 'کد ورود ترنج ارسال شد.',
				'register' => 'کد ثبت نام ارسال شد.',
				'send'     => 'کد ارسال شد.',
			],

			'voice' => [
				'register' => 'کد عضویت شما: :token تکرار، :token',
				'login'    => 'کد ورود شما: :token تکرار، :token',
				'reset'    => 'کد بازیابی شما: :token تکرار، :token',
				'called'   => 'تماس صوتی برقرار شد.',
				'failed'   => 'خطایی در تماس صوتی رخ داده است.',
			],

			'login' => [
				'success' => 'ورود با موفقیت انجام شد.',
				'failed'  => 'اطلاعات وارد شده معتبر نمی باشد.',
				'access'  => 'شما قادر به ورود به سیستم نیستید.',
			],

			'logout' => [
				'success' => 'خروج با موفقیت انجام شد.',
			],

			'register' => [
				'success'      => 'ثبت نام با موفقیت انجام شد.',
				'invalidRefer' => 'شماره معرف یافت نشد.',
			],

			'refresh' => [
				'invalid' => 'توکن معتبر نمی باشد.',
			],

			'password' => [
				'valid'     => [
					'success' => 'کد بازیابی رمز عبور صحبح می باشد',
					'failed'  => 'کد بازیابی رمز عبور صحیح نمی باشد.',
				],
				'change'    => [
					'success' => 'رمز عبور با موفقیت تغییر کرد.',
					'failed'  => 'تغییر رمز عبور با خطا مواجه شد.',
				],
				'incorrect' => 'رمز عبور معتبر نمی باشد.',
			],

			'firebase_token' => 'توکن برای ارسال نوتیفیکیشن با موفقیت به روز رسانی شد',

			'profile' => [
				'update_success' => 'پروفایل شما با موفقیت به روز شد.',
				'complete'       => 'پروفایل کامل است.',
				'incomplete'     => 'برای استفاده از تمام امکانات برنامه ابتدا پروفایل خود را تکمیل، سپس فعالیت خود را شروع کنید.',
				'show'           => 'پروفایل با موفقیت نمایش داده شد.',
				'notAdmin'       => 'این مسیر مربوط به نقش کاربری شما نیست',
			],

			'provider' => [
				'incomplete'      => 'برای استفاده از امکانات برنامه ابتدا اطلاعات ویزیتوری خود را تکمیل کنید.',
				'brand_not_exist' => 'شما چنین برندی در لیست خود ندارید.',
				'not_complete'    => 'اطلاعات ویزیتوری تکمیل نشده است.',
				'complete'        => 'اطلاعات ویزیتوری کامل است.',
				'show'            => 'اطلاعات ویزیتوری با موفقیت نمایش داده شد.',
			],

			'photo' => [
				'success' => 'آواتار با موفقیت قرار داده شد.',
				'failed'  => 'بارگذاری با مشکل مواجه شد.',
			],

			'token' => [
				'success' => 'کد دسترسی معتبر است.',
				'failed'  => 'کد دسترسی معتبر نمی باشد.',
			],
		],

		'order' => [
			'submit_success'      => 'سفارش شما با موفقیت ثبت شد.',
			'less_than_min_order' => 'قیمت کل سفارش کم تر از حداقل سفارش تامین کننده است.',
			'empty'               => 'سبد خرید شما خالی است.',
			'no_stock'            => 'موجودی برخی بسته های سبد خرید به اندازه کافی نمی باشد.',
			'fee_changed'         => 'قیمت برخی بسته های سبد خرید شما تغییر کرده است.',
			'status_failed'       => 'در حال حاضر موجود نمی باشد.',
			'cancel_failed'       => 'سفارش در حال پردازش می باشد. امکان لغو وجود ندارد.',
			'cancel_impossible'   => 'لغو سفارش امکان پذیر نمی باشد.',
			'doesNotShippedYet'   => 'سفارش هنوز ارسال نشده است',
			'cancel_success'      => 'سفارش با موفقیت لغو شد.',
			'reorder'             => 'سفارش مجدد با موفقیت انجام شد.',
			'failed_reorder'      => 'محصولات سفارش مورد نظر در سیستم غیر فعال می باشند.',
			'repetitive_status'   => 'این سفارش از قبل :status  شده است',
			'returned_failed'     => 'سفارش مرجوع شده امکان تغییر وضعیت ندارد',
			'updated'             => 'فاکتور شماره :number ویرایش شد.',
		],

		'orderItem' => [
			'quantityNotSupported' => 'تعداد جدید می بایست کمتر از تعداد فعلی باشد.',
			'notExistInOrder'      => 'بسته درخواستی در سفارش موجود نمی باشد.',
			'note'                 => ':name ، توسط شخص :user ، از تعداد :oldCount به تعداد :newCount تغییر کرد. دلیل تغییر :desc',
			'updated'              => 'فاکتور با موفقیت بروز رسانی شد.',
		],


		'prize' => [
			'request' => [
				'success' => 'درخواست شما با موفقیت ثبت شد.',
				'failed'  => 'امتیاز شما برای ثبت این جایزه کافی نمی باشد.',
			],
		],

		'cart' => [
			'add_success'        => 'با موفقیت انجام شد.',
			'min_order_failed'   => 'شما باید حداقل :quantity عدد به سبد خرید اضافه کنید.',
			'no_stock'           => 'تعداد بسته درخواست شده در انبار موجود نمی باشد.',
			'city_failed'        => 'این بسته در شهر شما موجود نیست.',
			'remove_success'     => 'با موفقیت حذف شد.',
			'remove_failed'      => 'قادر به حذف این آیتم نیستید.',
			'update'             => 'قیمت بسته با موفقیت بروزرسانی شد.',
			'status_failed'      => 'در حال حاضر این امکان فراهم نیست.',
			'cartNotBelongToYou' => 'اطلاعات سبد خرید انتخابی مربوط به کاربر دیگریست',
		],

		'package' => [
			'not_found'     => 'یافت نشد.',
			'availableCity' => [
				'failed' => 'بسته ای برای شهر شما یافت نشد.',
			],
			'remove'        => 'با موفقیت حذف شد.',
			'update'        => 'با موفقیت به روز رسانی شد.',
		],

		'ticket' => [
			'contact' => 'با موفقیت ثبت شد.',
		],
	],

];
