<?php

return [

	'dashboard' => [
		'subTitle' => 'داشبورد مدیریت سیستم کارت ویزیت',
	],

	'user' => [
		'index'      => [
			'title'    => 'کاربران فعال',
			'subTitle' => 'لیست کاربران فعال سیستم',
		],
		'indexBlack' => [
			'title'    => 'کاربران غیر فعال',
			'subTitle' => 'لیست کاربران غیر فعال سیستم',
		],
		'datatable'  => [
			'ref' => 'بدون معرف',
		],

	],

	'vcard' => [
		'index'      => [
			'title'    => 'کارت های فعال',
			'subTitle' => 'لیست کارت ویزیت های فعال سیستم',
		],
		'indexBlack' => [
			'title'    => 'کارت های غیر فعال',
			'subTitle' => 'لیست کارت ویزیت های غیر فعال سیستم',
		],
	],

	'report' => [
		'index' => [
			'title'    => 'کارت های گزارش شده',
			'subTitle' => 'لیست کارت ویزیت های گزارش شده فعال سیستم',
		],
	],

	'notification' => [
		'index'     => [
			'title'    => 'نوتیفیکیشن',
			'subTitle' => 'لیست نوتیفیکیشن های ارسال شده از سیستم',
		],
		'datatable' => [
			'active'   => 'فعال',
			'inactive' => 'غیر فعال',
		],
		'key'       => [
			'title'    => 'پارامتر',
			'subTitle' => 'لیست پارامتر های ثبت شده در سیستم',
		],
		'sweet'     => [
			'title'     => [
				'success' => 'موفقیت آمیز',
				'error'   => 'وجود خطا !',
			],
			'status'    => [
				'body'         => 'نوتیفیکیشن با موفقیت ارسال شد.',
				'body-warning' => 'نوتیفیکیشن قبلا ارسال شده است.',
			],
			'keyStatus' => [
				'body' => 'وضعیت پارامتر با موفقیت بروز رسانی شد.',
			],
			'keyStore'  => [
				'body' => 'پاراکتر با موفقیت در سیستم ثبت شد.',
			],
		],
	],

];
