<?php

return [

	'exception' => [
		'not_found'             => 'اطلاعاتی درخواستی یافت نشد.',
		'model_not_found'       => ':model درخواستی یافت نشد.',
		'not_access'            => 'شما دسترسی کافی ندارید.',
		'not_auth'              => 'شما وارد سیستم نشده اید.',
		'method_not_allow'      => 'متد معتبر نمی باشد.',
		'access_deny'           => 'شما دسترسی ندارید.',
		'too_many_request'      => 'درخواست بیش از اندازه! بسه دیگه.',
		'invalid_request'       => 'درخواست نامعتبر است.',
		'not_found_transaction' => 'تراکنش یافت نشد.',
		'port_not_found'        => 'درگاه یافت نشد.',
		'pay_send_exception'    => 'در حال حاضر درگاه پرداخت قطع می باشد. به زودی مشکل برطرف خواهد شد.',
		'action_exception'      => 'در حال حاضر این امکان فعال نمی باشد.',
	],

	'accessToken' => [
		'valid' => 'توکن معتبر است.',
	],

	'user' => [
		'notFound' => 'کاربر یافت نشد.',
		'created'  => 'کاربر با موفقیت ایجاد شد.',
		'deleted'  => 'کاربر با موفقیت حذف شد.',
		'updated'  => 'کاربر با موفقیت بروزرسانی شد.',
		'exist'    => 'کاربر قبلا ثبت نام شده است.',
		'profile'  => [
			'password_fail' => 'کلمه عبور فعلی صحیح نمی باشد.',
			'updated'       => 'کاربر با موفقیت بروزرسانی شد.',
		],
		'list'     => 'لیست کاربران با موفقیت نمایش داده شد.',
	],

	'city' => [
		'created' => 'شهر با موفقیت ایجاد شد.',
		'shown'   => 'اطلاعات شهر با موفقیت ارسال شد.',
		'updated' => 'شهر با موفقیت بروزرسانی شد.',
	],

	'state' => [
		'created' => 'استان با موفقیت ایجاد شد.',
		'shown'   => 'اطلاعات استان با موفقیت ارسال شد.',
		'updated' => 'استان با موفقیت بروزرسانی شد.',
	],

	'category' => [
		'created'              => 'دسته بندی با موفقیت ایجاد شد.',
		'updated'              => 'دسته بندی با موفقیت بروزرسانی شد.',
		'deleted'              => 'دسته بندی با موفقیت حذف شد.',
		'delete_used_category' => 'این دسته بندی نمی تواند حذف شود.',
		'show'                 => 'دسته بندی با موفقیت نمایش شد.',
		'children'             => 'لیست زیردسته ها با موفقیت نمایش داده شد.',
		'notNullParentId'      => 'دسته بندی نمی تواند شاخه اصلی باشد.',
		'notValid'             => 'دسته بندی های انتخاب شده معتبر نیست.',
	],

	'sms' => [
		'password_reset'        => 'کد بازیابی رمز عبور حساب سامانه کارت ویزیت شما: ',
		'register_success'      => 'ثبت نام شما در سامانه کارت ویزیت با موفقیت انجام شد. نام کاربری شما: ',
		'login'                 => 'کد ورود به سامانه کارت ویزیت: :token',
		'register'              => 'کد ثبت نام سامانه کارت ویزیت: :token',
		'confirmation'          => 'کد تایید سامانه کارت ویزیت: :token',
		'daily_submitted_order' => ":date\n:count سفارش بررسی نشده در سامانه کارت ویزیت برای شما ثبت شده است.",
		'two_minute'            => 'برای دریافت کد جدید :minute دقیقه منتظر بمانید',
		'valid_code'            => 'کد موقت تایید شد.',
		'invalid_code'          => 'کد موقت اعتبار ندارد.',
		'wrong_code'            => 'کد موقت اشتباه است.',
		'not_send_code'         => 'کد موقت ارسال نشده است.',
	],

	'voice' => [
		'register_success' => 'سلام. کد تایید سامانه کارت ویزیت شما:',
		'register'         => 'کد عضویت شما: :token تکرار، :token',
		'login'            => 'کد ورود شما: :token تکرار، :token',
		'reset'            => 'کد بازیابی شما: :token تکرار، :token',
		'called'           => 'تماس صوتی برقرار شد',
		'failed'           => 'خطایی در تماس صوتی رخ داده است',
		'minute'           => 'برای تماس جدید :minute دقیقه منتظر بمانید',
		'two_minute'       => 'برای درخواست تماس :minute دقیقه منتظر بمانید',
	],

	'request' => [
		'invalid' => 'درخواست نامعتبر است',
		'success' => 'درخواست با موفقیت انجام شد',
	],

	'photo' => [
		'avatar'         => 'آواتار با موفقیت آپلود شد.',
		'avatarReplaced' => 'آواتار با موفقیت جایگزین شد.',
		'success'        => 'تصویر با موفقیت آپلود شد.',
		'deleted'        => 'تصویر با موفقیت حذف شد.',
		'replaced'       => 'تصویر با موفقیت جایگزین شد.',
	],

	'visitCard' => [
		'create'            => 'اطلاعات برای ایجاد کارت ویزیت جدید ایجاد شد.',
		'stored'            => 'کارت ویزیت با موفقیت ایجاد شد.',
		'updated'           => 'کارت ویزیت با موفقیت بروزرسانی شد.',
		'updatedStatus'     => 'وضعیت کارت ویزیت با موفقیت بروزرسانی شد.',
		'requiredAddress'   => 'انتخاب یا وارد کردن آدرس الزامی است.',
		'notExist'          => 'کارت ویزیت پیدا نشد.',
		'invalidStatus'     => 'وضعیت جدید با وضعیت فعلی یکسان است.',
		'alreadyFavorite'   => 'کارت ویزیت از قبل نشان شده است.',
		'initSale'          => 'برای ثبت کارت ویزیت جدید میبایست هزینه ثبت پرداخت کنید.',
		'isUserSeenFail'    => 'قبلا شمارشگر اعمال شده است.',
		'isUserSeenSuccess' => 'شمارشگر با موفقیت اعمال شد.',
	],

	'social' => [
		'stored'        => 'راه ارتباطی با موفقیت ایجاد شد.',
		'notValid'      => 'راه ارتباطی معنبر نمی باشد.',
		'notExist'      => 'راه ارتباطی پیدا نشد.',
		'invalidStatus' => 'وضعیت جدید با وضعیت فعلی یکسان است.',
		'updatedStatus' => 'وضعیت راه ارتباطی با موفقیت بروزرسانی شد.',
		'updated'       => 'راه ارتباطی با موفقیت بروزرسانی شد.',
	],

	'favorite' => [
		'stored'        => 'نشان شده با موفقیت ایجاد شد.',
		'deleted'       => 'نشان شده با موفقیت حذف شد.',
		'invalid'       => 'نشان شده نامعتبر است.',
		'invalidNotYou' => 'نشان شده متعلق به شما نیست.',
	],

	'option' => [
		'list'   => 'لیست تنظیمات سیستم با موفقیت نمایش داده شد',
		'store'  => 'تنظیمات مورد نظر به سیستم اضافه شد',
		'update' => 'تنظیمات مورد نظر برای سیستم به روزرسانی شد ',
		'edit'   => 'اطلاعات برای ویرایش ارسال شد',
		'show'   => 'اطلاعات برای نمایش ارسال شد',

	],

	'report' => [
		'reported'          => 'گزارش با موفقیت ثبت شد.',
		'reportNotPossible' => 'امکان ثبت گزارش دهی برای شما امکان پذبر نیست.',
		'invalidStatus'     => 'وضعیت جدید با وضعیت فعلی یکسان است.',
		'updatedStatus'     => 'وضعیت گزارش با موفقیت بروزرسانی شد.',
		'deleted'           => 'گزارش با موفقیت حذف شد.',
	],

	'ads' => [
		'index'     => 'لیست آگهی ها با موفقیت نمایش داده شد',
		'lock_edit' => 'به دلیل تایید آگهی ، امکان ویرایش وجود ندارد',
		'edit'      => 'اطلاعات آگهی برای ویرایش با موفقیت ارسال شد',
		'showed'    => 'آگهی با موفقیت نمایش داده شد',
		'created'   => 'آگهی با موفقیت ایجاد شد.',
		'updated'   => 'آگهی با موفقیت بروزرسانی شد.',
		'deleted'   => 'آگهی با موفقیت حذف شد.',
	],

	'notification' => [
		'deliver' => 'ثبت دریافت نوتیفیکیشن با موفقیت انجام شد.',
		'click'   => 'ثبت کلیک نوتیفیکیشن با موفقیت انجام شد.',
	],

	'payment' => [
		'pointPackage' => 'خرید بسته امتیازی',
	],

];
